Revit 2027 API
ViewDisplaySketchyLines.Jitter Property
 The jitter defines jitteriness of the line. Values between 0 and 10.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Jitter { get; set; }
Public Property Jitter As Integer
	Get
	Set
public:
property int Jitter {
	int get ();
	void set (int value);
}
member Jitter : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The jitter value is not valid. The valid range is 0 to 10.
See Also
Reference
ViewDisplaySketchyLines Class
Autodesk.Revit.DB Namespace